package day14;

import java.util.Scanner;

public class Ch03Ex05 {

	public static void main(String[] args) {
		// -1을 입력하면 그만~ 아니면 계속 반복.
		//	크기 >> 5
		//	*****
		//	**  *
		//	* * *
		//	*  **
		//	*****
		//
		//	*****
		//	** **
		//	*   *
		//	** **
		//	*****
		
		// 크기 >> 7
		// *******
		// **    *
		// * *   *
		// *  *  *
		// *   * *
		// *    **
		// *******
		
		// *******
		// * * * *
		// **   **
		// *     *
		// **   **
		// * * * *
		// *******
		
		// 배열과 반복을 연습하는 주말과제

	}

}
